In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
# warunkowe wybieranie:

In [8]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
booldf = df > 0

In [11]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
# taki sam rezulat można osiągnąć:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [16]:
df[df['W']>0] # wyrzuca z kolumny W wiersz, w którym wystąpiła wartość < 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df[df['Z']<0] # zwróci DataFrame, ktory jest zależny od zadanego warunku

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [20]:
resultdf = df[df['W']>0]

In [21]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [23]:
# powyższe dwie linijki można wyśiwetlić za pomocą:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [25]:
# można także podzielić na wiele kroków, dla lepszego zrozumienia kodu:
boolser = df['W']>0

In [26]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [27]:
result = df[boolser]

In [28]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
mycols = ['X','Y']
result[mycols]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [31]:
# wiele warunków:

In [32]:
# dlaczego to jest niedozwolone:
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [33]:
# ponieważ operacje typu and, or etc. przyjmują tyko porównanie tylko pojedynczych wartości typu bool
# a nie serii takich wartości!

In [34]:
True and False

False

In [35]:
True and True

True

In [36]:
# dlatego dla serii należy użyć operatora & (bitwise operator)
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

'''
Operatory binarne:
& - AND
| - OR
^ - XOR
~ - NOT
'''

In [38]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[(df['W']>0) ^ (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df[(df['W']>0) | ~(df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df.reset_index() # żeby zapisać na stałe należy dodać parametr inplace = True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
newind = 'LU WA KR WR GD'.split() # zamiana stringa na listę (białe naki)

In [49]:
newind

['LU', 'WA', 'KR', 'WR', 'GD']

In [50]:
df['Rejestracje'] = newind # dodanie nowej kolumny

In [51]:
df

          W         X         Y         Z Rejestracje
A  2.706850  0.628133  0.907969  0.503826          LU
B  0.651118 -0.319318 -0.848077  0.605965          WA
C -2.018168  0.740122  0.528813 -0.589001          KR
D  0.188695 -0.758872 -0.933237  0.955057          WR
E  0.190794  1.978757  2.605967  0.683509          GD

In [53]:
df.set_index('Rejestracje') # zastosowanie nowych indeksów na bazie listy stringów - stare indeksy zostaną zastąione

                    W         X         Y         Z
Rejestracje
LU           2.706850  0.628133  0.907969  0.503826
WA           0.651118 -0.319318 -0.848077  0.605965
KR          -2.018168  0.740122  0.528813 -0.589001
WR           0.188695 -0.758872 -0.933237  0.955057
GD           0.190794  1.978757  2.605967  0.683509

In [55]:
df # żeby zapisać wyżej wymienione zmiany, należało dodać paramert inplace=True

          W         X         Y         Z Rejestracje
A  2.706850  0.628133  0.907969  0.503826          LU
B  0.651118 -0.319318 -0.848077  0.605965          WA
C -2.018168  0.740122  0.528813 -0.589001          KR
D  0.188695 -0.758872 -0.933237  0.955057          WR
E  0.190794  1.978757  2.605967  0.683509          GD